---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofSlope
source: html/4e8510d4-9c30-8426-69f6-797d9481a7cf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofSlope Property

"Slope"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofSlope { get; }
```